000100190306     A          R RECORD1
000101190306     A                                  2  4USER
000102190306     A                                  2 28'Payroll Program Completed'
000103190306     A                                  2 66DATE EDTCDE(Y)
000104190306     A                                  3  4'Artem Kulihina'
000105190306     A                                  5 10'Rates:'
000106190306     A                                  7 19'Day Rate:'
000107190306     A            DAYRATE        5  2   7 37EDTCDE(1)
000108190306     A                                  8 19'Afternoon Rate:'
000109190306     A            AFTNRATE       5  2   8 37EDTCDE(1)
000110190306     A                                  9 19'Night Rate:'
000111190306     A            NIGHTRATE      5  2   9 37EDTCDE(1)
000112190306     A                                 11 11'Totals:'
000113190306     A                                 13 19'Regular Pay:'
000114190306     A            TOTREGPAY      9Y 2O 13 37EDTCDE(1)
000115190306     A                                 14 19'Overtime Pay:'
000116190306     A            TOTOVTPAY      9Y 2O 14 37EDTCDE(1)
000117190306     A                                 15 19'Company Payout:'
000118190306     A            TOTEMPPAY      9Y 2O 15 37EDTCDE(1)
