000001190405       CTL-OPT NOMAIN DATFMT(*USA);
000002190405
000003190405       /COPY LAB10,DATEPROTOS
000004190405
000007190405               DCL-PROC DAYOFWEEK EXPORT;
000008190405
000009190405                DCL-PI *N ZONED(1);
000010190405
000011190405                  WORKDATE DATE;
000012190405
000013190405                END-PI;
000014190405
000015190405                DCL-S ANYSUNDAY DATE INZ(D'04/02/1995');
000017190405                DCL-S WORKNUM PACKED(7);
000019190405                DCL-S WORKDAY ZONED(1);
000020190405
000021190405                WORKNUM = %DIFF(WORKDATE : ANYSUNDAY: *D);
000023190405                WORKDAY = %REM(WORKNUM : 7);
000024190405
000025190405                IF WORKDAY = 0;
000027190405                  WORKDAY = 7;
000029190405                ENDIF;
000031190405                RETURN WORKDAY;
000032190405
000033190405              END-PROC;
000036190405
000037190405              DCL-PROC DAYNAME EXPORT;
000038190405
000039190405                DCL-PI *N CHAR(9);
000040190405
000041190405                  NUMBER PACKED(1);
000042190405
000043190405                END-PI;
000044190405
000045190405                DCL-DS DAYDATA;
000046190405
000047190405                  *N CHAR(9) INZ('Monday');
000048190405
000049190405                  *N CHAR(9) INZ ('Tuesday');
000050190405
000051190405                  *N CHAR(9) INZ ('Wednesday');
000052190405
000053190405                  *N CHAR(9) INZ ('Thursday');
000054190405
000055190405                  *N CHAR(9) INZ ('Fiday');
000056190405
000057190405                  *N CHAR(9) INZ ('Saturday');
000058190405
000059190405                  *N CHAR(9) INZ ('Sunday');
000060190405
000061190405                  DAYARRAY CHAR(9) DIM(7) POS(1);
000062190405
000063190405                END-DS;
000064190405
000065190405                RETURN DAYARRAY(NUMBER);
000066190405
000067190405              END-PROC;
