000100990120
001700190405       Dcl-Pr DAYOFWEEK ZONED(1) ;
001702190405           WorkDate Date;
001704190405         End-Pr;
001707190405
001708190405       Dcl-Pr DAYNAME Char(9);
001710190405           NUMBER PACKED(1);
001712190405         End-Pr;
001715190405
001716190405       Dcl-Pr DateWords Char(28);
001718190405           WorkDate  Date;
001720190405         End-Pr;
001723190405
001724190405         Dcl-Pr FindDay  Char(9);
001726190405           WorkDate  Date;
001728190405         End-Pr;
001729190405
001732190405       Dcl-Pr DAYNUMNAME CHAR(9);
001734190405           NUMBER PACKED(1);
001736190405         End-Pr;
