000001190405       CTL-OPT DATFMT(*USA);
000005190405       DCL-F WHATDAYDSP WORKSTN;
000007190405        /COPY LAB10,DATEPROTOS
000013190405              DCL-S WORKDAY PACKED(1);
000015190405              DCL-S WORKDATE DATE;
000019190405              EXFMT INPUT;
000020190405
000023190405              DOW NOT *IN03;
000025190405
000027190405                WORKDATE = DATEIN;
000029190405                WORKDAY = DAYOFWEEK(WORKDATE);
000032190405
000033190405                RESULT1 = 'The Day of Week is:' + %CHAR(WORKDAY);
000037190405                RESULT2 = 'That''s a ' + DAYNAME(WORKDAY);
000041190405                RESULT3 = '';
000044190405
000045190405                *IN90 =*ON;
000047190405                WRITE INPUT;
000049190405                EXFMT OUTPUT;
000051190405                *IN90 = *OFF;
000053190405
000055190405                IF NOT *IN03;
000057190405                  EXFMT INPUT;
000059190405                ENDIF;
000060190405
000061190405              ENDDO;
000062190405
000063190405              *INLR = *ON;
000065190405              RETURN;
