000000190315     A          R ALLSHIFT                  PFILE(SENECAPAY/ALLSHIFT)
000000190315     A          K EMPNUM
000000190315     A          S WORKSHIFT                 COMP(EQ 'A')
