000100190315     A          R RECORD1
000200190315     A                                  2  4USER
000300190315     A                                  2 28'Payroll Program Completed'
000400190315     A                                  2 66DATE EDTCDE(Y)
000500190315     A                                  3  4'Artem Kulihina'
000600190315     A                                  5 10'Rates:'
000700190315     A                                  7 19'Day Rate:'
000800190315     A            DAYRATE        5  2   7 37EDTCDE(1)
000900190315     A                                  8 19'Afternoon Rate:'
001000190315     A            AFTNRATE       5  2   8 37EDTCDE(1)
001100190315     A                                  9 19'Night Rate:'
001200190315     A            NIGHTRATE      5  2   9 37EDTCDE(1)
001300190315     A                                 12 11'Totals:'
001400190315     A                                 13 19'Regular Pay:'
001500190315     A            TOTREGPAY      9Y 2O 13 37EDTCDE(1)
001600190315     A                                 14 19'Overtime Pay:'
001700190315     A            TOTOVTPAY      9Y 2O 14 37EDTCDE(1)
001800190315     A                                 15 19'Company Payout:'
001900190315     A            TOTEMPPAY      9Y 2O 15 37EDTCDE(1)
002000190315     A            SHIFTTYPE     30   O 11 22
002100190315
