000101190222             PGM
000102190222
000103190222             CALL       QGPL/STRJOB
000104190222             ADDLIBLE   BCI433LIB
000105190222             MONMSG     MSGID(CPF2103) EXEC(GOTO DSP)
000106190222 DSP:        DSPSYSLVL  *DISPLAY
000107190222             ENDPGM
000108190222
000109190222
